In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import display

%pylab inline
pylab.rcParams['figure.figsize'] = (18, 5)
pd.set_option('display.max_rows', None)

Populating the interactive namespace from numpy and matplotlib

In [2]:
df = pd.DataFrame([[1, 2], [1.4, np.nan], [1.3, 3]])
display(df)

df[[0, 1]].min(axis=1)

     0    1
0  1.0  2.0
1  1.4  NaN
2  1.3  3.0

0    1.0
1    1.4
2    1.3
dtype: float64

In [3]:
display(df.mean(axis=0))
display(np.mean(df.values, axis=0))

0    1.233333
1    2.500000
dtype: float64

array([1.23333333,        nan])

In [4]:
data = {
    'city': ['NY','NY', 'SF','SF','SF'],
    'cuisine': ['Japanese', 'Chinese', 'French', 'Japanese', 'Japanese']
}

df = pd.DataFrame(data)
df

  city   cuisine
0   NY  Japanese
1   NY   Chinese
2   SF    French
3   SF  Japanese
4   SF  Japanese

In [5]:
df["value"]=1
pd.pivot_table(df, values="value", index=["city"], columns="cuisine", fill_value=0, aggfunc=len)

cuisine  Chinese  French  Japanese
city
NY             1       0         1
SF             0       1         2

In [6]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'], 'value': np.random.randn(4)})
display(df1)
display(df2)

pd.merge(df1, df2, on='key')

  key     value
0   A  0.909384
1   B  0.911661
2   C -0.941388
3   D  1.157019

  key     value
0   B  1.473545
1   D -0.532389
2   D  1.473857
3   E  0.905469

  key   value_x   value_y
0   B  0.911661  1.473545
1   D  1.157019 -0.532389
2   D  1.157019  1.473857

In [7]:
df = pd.DataFrame({'a': np.arange(5), 'b': np.arange(100, 105), 'c': np.arange(200, 205)})
display(df)
df[['a', 'c']] = np.arange(20, 30).reshape(5, -1)
display(df)

   a    b    c
0  0  100  200
1  1  101  201
2  2  102  202
3  3  103  203
4  4  104  204

    a    b   c
0  20  100  21
1  22  101  23
2  24  102  25
3  26  103  27
4  28  104  29

In [8]:
mi = pd.MultiIndex.from_arrays([df.columns.repeat(3), ['min', 'mean', 'max'] * 3])
print(mi)
pdf = pd.DataFrame(columns=mi)
display(pdf)
[1, 2, 3] + [4]

MultiIndex(levels=[['a', 'b', 'c'], ['max', 'mean', 'min']],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [2, 1, 0, 2, 1, 0, 2, 1, 0]])

Empty DataFrame
Columns: [(a, min), (a, mean), (a, max), (b, min), (b, mean), (b, max), (c, min), (c, mean), (c, max)]
Index: []

[1, 2, 3, 4]

In [10]:
df.index.rename(33)

RangeIndex(start=0, stop=5, step=1, name=33)

In [17]:
np.arange(6).reshape(-1, 2)[[True, False, False]]

array([[0, 1]])

In [21]:
pd.datetime(2017, 1, 1)

datetime.datetime(2017, 1, 1, 0, 0)